app/controllers/comments_controller.rb

  def create

    @comment = @post.comments.create(comment_params)
---
INSERT INTO "comments" ("content", "name", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["content", "r"], ["name", "Ricky"], ["created_at", "2020-04-27 16:47:25.480013"], ["updated_at", "2020-04-27 16:47:25.480013"], ["post_id", 1]]