app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @pages = Page.all