app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?)  [["title", "Kittens"], ["created_at", "2020-04-26 16:11:36.507022"], ["updated_at", "2020-04-26 16:11:36.507022"], ["body", "On the BLVD"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save